БИТУправление_медицинским_центром_демо/src/Documents/ВедомостьОВыплаченнойЗарплатеЧерезБанк/ВедомостьОВыплаченнойЗарплатеЧерезБанк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьОВыплаченнойЗарплатеЧерезБанк</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасчетыССотрудниками</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияДенежныхСредств</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.ЭквайринговыеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/ВзаиморасчетыССотрудниками/ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/ВедомостьОВыплаченнойЗарплатеЧерезБанк/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Выплаты") Тогда
			// Таблица выплаты
			Для Каждого СтрокаВыплаты Из ДанныеЗаполнения.Выплаты Цикл
				ЗаполнитьЗначенияСвойств(РасчетыССотрудниками.Добавить(), СтрокаВыплаты);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Заполнение краткого списка сотрудников документа (реквизит)
	СтрокаКраткийСоставДокумента = "";
	Сотрудники = Новый ТаблицаЗначений;
	Сотрудники = РасчетыССотрудниками.Выгрузить(,"Сотрудник");
	Сотрудники.Свернуть("Сотрудник");
	
	Для Каждого Строка Из Сотрудники Цикл
		ФИО = Строка.Сотрудник.Фамилия + " " + Лев(Строка.Сотрудник.Имя,1) + "." + Лев(Строка.Сотрудник.Отчество,1) + ".";
	    СтрокаКраткийСоставДокумента = СтрокаКраткийСоставДокумента + ФИО + ", ";
	КонецЦикла;
	КраткийСоставДокумента = Лев(Лев(СтрокаКраткийСоставДокумента,СтрДлина(СтрокаКраткийСоставДокумента)-2),50);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РегистрыНакопления.ДвиженияДенежныхСредств.СформироватьДвиженияПоШапкеДокумента(Новый Структура("Дата, СуммаДокумента, СтатьяДвиженияДенежныхСредств", Дата, РасчетыССотрудниками.Итог("Сумма"), СтатьяДвиженияДенежныхСредств), Движения.ДвиженияДенежныхСредств, Ложь, Отказ);

	// Формирование движения по регистру "ВзаиморасчетыССотрудниками".
	РасчетыССотрудниками.Свернуть("Сотрудник","Сумма");
	
	Для Каждого СтрокаВыплат Из РасчетыССотрудниками Цикл
		
		Движение = Движения.ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
		Движение.Период					= Дата;
		Движение.Сотрудник				= СтрокаВыплат.Сотрудник;		
		Движение.Сумма					= СтрокаВыплат.Сумма;
	
	КонецЦикла;

КонецПроцедуры // ОбработкаПроведения()

#КонецОбласти
